GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F105xx.svd
						</field>
						<field>
							<name>TCINTEN</name><description>Transfer complete interrupt
              enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>HTINTEN</name><description>Half Transfer interrupt
              enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>TERRINTEN</name><description>Transfer error interrupt
              enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>DIRCFG</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>CIRMODE</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>PERIMODE</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>MIMODE</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>PERSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth>
							
							
							
						</field>
						<field>
							<name>MEMSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth>
							
							
							
						</field>
						<field>
							<name>CHPL</name><description>Channel Priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth>
							
							
							
						</field>
						<field>
							<name>M2MMODE</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
					</fields>
				</register>
				<register>
					<name>CHNDATA2</name><displayName>CHNDATA2</displayName>
					
					<description>DMA channel 2 number of data
          register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>NDATA</name>
							<description>Number of data to transfer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHPADDR2</name><displayName>CHPADDR2</displayName>
					
					<description>DMA channel 2 peripheral address
          register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>PERADDR</name>
							<description>Peripheral address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHMADDR2</name><displayName>CHMADDR2</displayName>
					
					<description>DMA channel 2 memory address
          register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>MEMADDR</name>
							<description>Memory address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHCFG3</name><displayName>CHCFG3</displayName>
					
					<description>DMA channel 3 configuration register
					</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>CHEN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>TCINTEN</name><description>Transfer complete interrupt
              enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>HTINTEN</name><description>Half Transfer interrupt
              enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>TERRINTEN</name><description>Transfer error interrupt
              enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>DIRCFG</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>CIRMODE</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>PERIMODE</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>MIMODE</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>PERSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth>
							
							
							
						</field>
						<field>
							<name>MEMSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth>
							
							
							
						</field>
						<field>
							<name>CHPL</name><description>Channel Priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth>
							
							
							
