GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F105xx.svd
			</registers>
		</peripheral><peripheral derivedFrom="DMA1"><name>DMA2</name><description/><groupName/><baseAddress>0x40020400</baseAddress><addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock><interrupt>
        <name>DMA2_Channel1</name>
        <description>DMA2 Channel1 global interrupt</description>
        <value>56</value>
      </interrupt><interrupt>
        <name>DMA2_Channel2</name>
        <description>DMA2 Channel2 global interrupt</description>
        <value>57</value>
      </interrupt><interrupt>
        <name>DMA2_Channel3</name>
        <description>DMA2 Channel3 global interrupt</description>
        <value>58</value>
      </interrupt><interrupt>
        <name>DMA2_Channel4</name>
        <description>DMA2 Channel4  global
        interrupt</description>
        <value>59</value>
      </interrupt><interrupt>
        <name>DMA2_Channel5</name>
        <description>DMA2 Channel5 global
        interrupt</description>
        <value>60</value>
      </interrupt></peripheral>
		<peripheral>
			<name>USART1</name>
			<description>Universal synchronous asynchronous receiver  transmitter </description><groupName>USART</groupName>
			<baseAddress>0x40013800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USART1</name>
				<description>USART1 global interrupt</description>
				<value>37</value>
			</interrupt>
			<registers>
				<register>
					<name>STS</name>
					<displayName>STS</displayName>
					<description>Status register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00C0</resetValue>
					<fields>
						<field>
							<name>PEFLG</name>
							<description>Parity error</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>FEFLG</name>
							<description>Framing error</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>NEFLG</name>
							<description>Noise error flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>OVREFLG</name>
							<description>Overrun error</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>IDLEFLG</name>
							<description>IDLE line detected</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>RXBNEFLG</name>
							<description>Read data register not
              empty</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>TXCFLG</name>
							<description>Transmission complete</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>TXBEFLG</name>
							<description>Transmit data register
              empty</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>LBDFLG</name>
							<description>LIN break detection flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>CTSFLG</name>
							<description>CTS flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA</name>
					<displayName>DATA</displayName>
					<description>TX Buffer Data Register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATA</name>
							<description>Data value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BR</name>
					<displayName>BR</displayName>
					<description>Baud rate register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>FBR</name>
							<description>Fraction of USARTDIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field><field>
							<name>IBR</name>
							<description>Integer of USARTDIV</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL1</name>
					<displayName>CTRL1</displayName>
					<description>Control register 1</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TXBF</name>
							<description>Send break</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RXMUTEEN</name>
							<description>Receiver wakeup</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RXEN</name>
							<description>Receiver enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TXEN</name>
							<description>Transmitter enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>IDLEIEN</name>
							<description>IDLE interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RXBNEIEN</name>
							<description>RXBNE interrupt enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TXCIEN</name>
							<description>Transmission complete interrupt
              enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TXBEIEN</name>
							<description>TXBE interrupt enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>PEIEN</name>
							<description>PE interrupt enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>PCFG</name>
							<description>Parity selection</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>PCEN</name>
							<description>Parity control enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>WUPMCFG</name>
							<description>Wakeup method</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>DBLCFG</name>
							<description>Word length</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>UEN</name>
							<description>USART enable</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL2</name>
					<displayName>CTRL2</displayName>
					<description>Control register 2</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address of the USART node</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field><field>
							<name>LBDLCFG</name>
							<description>lin break detection length</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>LBDIEN</name>
							<description>LIN break detection interrupt
              enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>LBCPOEN</name>
							<description>Last bit clock pulse</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CPHA</name>
							<description>Clock phase</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CPOL</name>
							<description>Clock polarity</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CLKEN</name>
							<description>Clock enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>STOPCFG</name>
							<description>STOP bits</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>LINMEN</name>
							<description>LIN mode enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL3</name>
					<displayName>CTRL3</displayName>
					<description>Control register 3</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ERRIEN</name>
							<description>Error interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>IREN</name>
							<description>IrDA mode enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>IRLPEN</name>
							<description>IrDA low-power</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>HDEN</name>
							<description>Half-duplex selection</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SCNACKEN</name>
							<description>Smartcard NACK enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SCEN</name>
							<description>Smartcard mode enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>DMARXEN</name>
							<description>DMA enable receiver</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>DMATXEN</name>
							<description>DMA enable transmitter</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RTSEN</name>
							<description>RTS enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CTSEN</name>
							<description>CTS enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CTSIEN</name>
							<description>CTS interrupt enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GTPSC</name>
					<displayName>GTPSC</displayName>
					<description>Guard time and divider number register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>PSC</name>
							<description>Prescaler value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>GRDT</name>
							<description>Guard time value</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
