GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F105xx.svd
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>FFULLFLG1</name><description>FFULLFLG1</description>
							
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>FOVRFLG1</name><description>FOVRFLG1</description>
							
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>RFOM1</name><description>RFOM1</description>
							
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INTEN</name>
					<displayName>INTEN</displayName>
					<description>CAN Interrupts register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TXMEIEN</name>
							<description>TXMEIEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMIEN0</name>
							<description>FMIEN0</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFULLIEN0</name>
							<description>FFULLIEN0</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FOVRIEN0</name>
							<description>FOVRIEN0</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMIEN1</name><description>FMIEN1</description>
							
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFULLIEN1</name><description>FFULLIEN1</description>
							
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FOVRIEN1</name><description>FOVRIEN1</description>
							
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ERRWIEN</name>
							<description>ERRWIEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ERRPIEN</name>
							<description>ERRPIEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>BOFFIEN</name>
							<description>BOFFIEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>LECIEN</name>
							<description>LECIEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ERRIEN</name>
							<description>ERRIEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>WUPIEN</name>
							<description>WUPIEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SLEEPIEN</name>
							<description>SLEEPIEN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRSTS</name>
					<displayName>ERRSTS</displayName>
					<description>CAN Error States register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ERRWFLG</name>
							<description>ERRWFLG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>ERRPFLG</name>
							<description>ERRPFLG</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>BOFLG</name>
							<description>BOFLG</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>LERRC</name>
							<description>LERRC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>TXERRCNT</name>
							<description>TXERRCNT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>RXERRCNT</name>
							<description>RXERRCNT</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BITTIM</name>
					<displayName>BITTIM</displayName>
					<description>CAN Bit Time register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BRPSC</name>
							<description>BRPSC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
						</field><field>
							<name>TIMSEG1</name>
							<description>TIMSEG1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field><field>
							<name>TIMSEG2</name>
							<description>TIMSEG2</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
						</field><field>
							<name>RSYNJW</name>
							<description>RSYNJW</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>LBKMEN</name>
							<description>LBKMEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SILMEN</name>
							<description>SILMEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMID0</name>
					<displayName>TXMID0</displayName>
					<description>CAN Each mailbox contains the sending mailbox identifier register 0</description>
					<addressOffset>0x180</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TXMREQ</name>
							<description>TXMREQ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TXRFREQ</name>
							<description>TXRFREQ</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>IDTYPESEL</name>
							<description>IDTYPESEL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>EXTID</name>
							<description>EXTID</description>
							<bitOffset>3</bitOffset>
							<bitWidth>18</bitWidth>
						</field><field>
							<name>STDID</name>
							<description>STDID</description>
							<bitOffset>21</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TXDLEN0</name>
					<displayName>TXDLEN0</displayName>
					<description>CAN Send the mailbox data length and timestamp register 0</description>
					<addressOffset>0x184</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DLCODE</name>
							<description>DLCODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMDL0</name>
					<displayName>TXMDL0</displayName>
					<description>CAN Send mailbox low byte data register 0</description>
					<addressOffset>0x188</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATABYTE0</name>
							<description>DATABYTE0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE1</name>
							<description>DATABYTE1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE2</name>
							<description>DATABYTE2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE3</name>
							<description>DATABYTE3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMDH0</name>
					<displayName>TXMDH0</displayName>
					<description>CAN Send mailbox High byte data register 0</description>
					<addressOffset>0x18C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATABYTE4</name>
							<description>DATABYTE4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE5</name>
							<description>DATABYTE5</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE6</name>
							<description>DATABYTE6</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE7</name>
							<description>DATABYTE7</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMID1</name><displayName>TXMID1</displayName><description>CAN Each mailbox contains the sending mailbox identifier register 1</description><addressOffset>0x190</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>TXMREQ</name>
							<description>TXMREQ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TXRFREQ</name>
							<description>TXRFREQ</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>IDTYPESEL</name>
							<description>IDTYPESEL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>EXTID</name>
							<description>EXTID</description>
							<bitOffset>3</bitOffset>
							<bitWidth>18</bitWidth>
						</field><field>
							<name>STDID</name>
							<description>STDID</description>
							<bitOffset>21</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TXDLEN1</name><displayName>TXDLEN1</displayName><description>CAN Send the mailbox data length and timestamp register 1</description><addressOffset>0x194</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>DLCODE</name>
							<description>DLCODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field><field>
							<name>TXTS</name>
							<description>TXTS       </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>MTS</name>
							<description>MTS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMDL1</name><displayName>TXMDL1</displayName><description>CAN Send mailbox low byte data register 1</description><addressOffset>0x198</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>DATABYTE0</name>
							<description>DATABYTE0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE1</name>
							<description>DATABYTE1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE2</name>
							<description>DATABYTE2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE3</name>
							<description>DATABYTE3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMDH1</name><displayName>TXMDH1</displayName><description>CAN Send mailbox High byte data register1</description><addressOffset>0x19C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>DATABYTE4</name>
							<description>DATABYTE4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE5</name>
							<description>DATABYTE5</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE6</name>
							<description>DATABYTE6</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE7</name>
							<description>DATABYTE7</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMID2</name><displayName>TXMID2</displayName><description>CAN Each mailbox contains the sending mailbox identifier register 2</description><addressOffset>0x1A0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>TXMREQ</name>
							<description>TXMREQ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TXRFREQ</name>
							<description>TXRFREQ</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>IDTYPESEL</name>
							<description>IDTYPESEL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>EXTID</name>
							<description>EXTID</description>
							<bitOffset>3</bitOffset>
							<bitWidth>18</bitWidth>
						</field><field>
							<name>STDID</name>
							<description>STDID</description>
							<bitOffset>21</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TXDLEN2</name><displayName>TXDLEN2</displayName><description>CAN Send the mailbox data length and timestamp register 2</description><addressOffset>0x1A4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>DLCODE</name>
							<description>DLCODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field><field>
							<name>TXTS</name>
							<description>TXTS       </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>MTS</name>
							<description>MTS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMDL2</name><displayName>TXMDL2</displayName><description>CAN Send mailbox low byte data register 2</description><addressOffset>0x1A8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>DATABYTE0</name>
							<description>DATABYTE0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE1</name>
							<description>DATABYTE1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE2</name>
							<description>DATABYTE2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE3</name>
							<description>DATABYTE3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMDH2</name><displayName>TXMDH2</displayName><description>CAN Send mailbox High byte data register2</description><addressOffset>0x1AC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>DATABYTE4</name>
							<description>DATABYTE4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE5</name>
							<description>DATABYTE5</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE6</name>
							<description>DATABYTE6</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE7</name>
							<description>DATABYTE7</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RXMID0</name>
					<displayName>RXMID0</displayName>
					<description>CAN Each mailbox contains the receive mailbox identifier register 0</description>
					<addressOffset>0x1B0</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RFTXREQ</name>
							<description>RFTXREQ</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>IDTYPESEL</name>
							<description>IDTYPESEL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>EXTID</name>
							<description>EXTID</description>
							<bitOffset>3</bitOffset>
							<bitWidth>18</bitWidth>
						</field><field>
							<name>STDID</name>
							<description>STDID</description>
							<bitOffset>21</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RXDLEN0</name>
					<displayName>RXDLEN0</displayName>
					<description>CAN receive the mailbox data length and timestamp register 0</description>
					<addressOffset>0x1B4</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DLCODE</name>
							<description>DLCODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field><field>
							<name>FMIDX</name>
							<description>FMIDX</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RXMDL0</name>
					<displayName>RXMDL0</displayName>
					<description>CAN receive mailbox low byte data register 0</description>
					<addressOffset>0x1B8</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATABYTE0</name>
							<description>DATABYTE0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE1</name><description>DATABYTE1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE2</name><description>DATABYTE2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE3</name><description>DATABYTE3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RXMDH0</name>
					<displayName>RXMDH0</displayName>
					<description>CAN receive mailbox High byte data register 0</description>
					<addressOffset>0x1BC</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATABYTE4</name><description>DATABYTE4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE5</name><description>DATABYTE5</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE6</name><description>DATABYTE6</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE7</name>
							<description>DATABYTE7</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RXMID1</name><displayName>RXMID1</displayName><description>CAN Each mailbox contains the receive mailbox identifier register 1</description><addressOffset>0x1C0</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>RFTXREQ</name>
							<description>RFTXREQ</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>IDTYPESEL</name>
							<description>IDTYPESEL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>EXTID</name>
							<description>EXTID</description>
							<bitOffset>3</bitOffset>
							<bitWidth>18</bitWidth>
						</field><field>
							<name>STDID</name>
							<description>STDID</description>
							<bitOffset>21</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RXDLEN1</name><displayName>RXDLEN1</displayName><description>CAN receive the mailbox data length and timestamp register 1</description><addressOffset>0x1C4</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>DLCODE</name>
							<description>DLCODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field><field>
							<name>FMIDX</name>
							<description>FMIDX</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RXMDL1</name><displayName>RXMDL1</displayName><description>CAN receive mailbox low byte data register 1</description><addressOffset>0x1C8</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>DATABYTE0</name>
							<description>DATABYTE0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE1</name><description>DATABYTE1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE2</name><description>DATABYTE2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE3</name><description>DATABYTE3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
