GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F105xx.svd
			</registers>
		</peripheral><peripheral>
			<name>DBGMCU</name>
			<description>Debug support</description><groupName>DBGMCU</groupName>
			<baseAddress>0xE0042000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>IDCODE</name>
					<displayName>IDCODE</displayName>
					<description>DBGMCU_IDCODE</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>EQR</name>
							<description>Equipment Recognition</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>WVR</name>
							<description>Wafer Version Recognition</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFG</name>
					<displayName>CFG</displayName>
					<description>DBGMCU_CFG</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>SLEEP_CLK_STS</name>
							<description>SLEEP_CLK_STS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STOP_CLK_STS</name>
							<description>STOP_CLK_STS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STANDBY_CLK_STS</name>
							<description>STANDBY_CLK_STS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOEN</name>
							<description>IOEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>MODE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>IWDT_STS</name>
							<description>IWDT_STS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WWDT_STS</name>
							<description>WWDT_STS</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR1_STS</name>
							<description>TMR1_STS</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR2_STS</name>
							<description>TMR2_STS</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR3_STS</name>
							<description>TMR3_STS</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR4_STS</name>
							<description>TMR4_STS</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAN1_STS</name>
							<description>CAN1_STS</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1_SMBUS_TIMEOUT_STS</name>
							<description>I2C1_SMBUS_TIMEOUT_STS</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C2_SMBUS_TIMEOUT_STS</name>
							<description>I2C2_SMBUS_TIMEOUT_STS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR8_STS</name>
							<description>TMR8_STS</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR5_STS</name>
							<description>TMR5_STS</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR6_STS</name>
							<description>TMR6_STS</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR7_STS</name>
							<description>TMR7_STS</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAN2_STS</name>
							<description>CAN2_STS</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TMR12_STS</name>
							<description>TMR12_STS</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TMR13_STS</name>
							<description>TMR13_STS</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TMR14_STS</name>
							<description>TMR14_STS</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TMR9_STS</name>
							<description>TMR9_STS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TMR10_STS</name>
							<description>TMR10_STS</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TMR11_STS</name>
							<description>TMR11_STS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral><peripheral>
			<name>DMC</name>
			<description>Dynamic memory controler</description><groupName>DMC</groupName>
			<alternatePeripheral>EMMC</alternatePeripheral><baseAddress>0xA0000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CFG</name>
					<displayName>CFG</displayName>
					<description>Configuraion register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00141388</resetValue>
					<fields>
						<field>
							<name>BAWCFG</name>
							<description>BAWCFG</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>RAWCFG</name>
							<description>RAWCFG</description>
							<bitOffset>5</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CAWCFG</name>
							<description>CAWCFG</description>
							<bitOffset>9</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DWCFG</name>
							<description>DWCFG</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIM0</name>
					<displayName>TIM0</displayName>
					<description>Timing register 0</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x019A5252</resetValue>
					<fields>
						<field>
							<name>CASLSEL0</name>
							<description>CASLSEL0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>RASMINTSEL</name>
							<description>RASMINTSEL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DTIMSEL</name>
							<description>DTIMSEL</description>
							<bitOffset>6</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>PCPSEL</name>
							<description>PCPSEL</description>
							<bitOffset>9</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>WRTIMSEL</name>
							<description>WRTIMSEL</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>ARPSEL</name>
							<description>ARPSEL</description>
							<bitOffset>14</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>XSR0</name>
							<description>XSR0</description>
							<bitOffset>18</bitOffset>
							<bitWidth>4</bitWidth>
						</field><field>
							<name>ATACP</name>
							<description>ATACP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>4</bitWidth>
						</field><field>
							<name>ECASLSEL1</name>
							<description>ECASLSEL1</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>EXSR1</name>
							<description>EXSR1</description>
							<bitOffset>27</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIM1</name>
					<displayName>TIM1</displayName>
					<description>Timing register 1</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00074E20</resetValue>
					<fields>
						<field>
							<name>STBTIM</name>
							<description>STBTIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field><field>
							<name>ARNUMCFG</name>
							<description>ARNUMCFG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL1</name>
					<displayName>CTRL1</displayName>
					<description>Control register 1</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					
