GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F105xx.svd
					<resetValue>0x00003049</resetValue>
					<fields>
						<field>
							<name>INIT</name>
							<description>INIT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth><access>read-write</access>
						</field><field>
							<name>SRMEN</name>
							<description>SRMEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth><access>read-write</access>
						</field><field>
							<name>PDMEN</name>
							<description>PDMEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth><access>read-write</access>
						</field><field>
							<name>PCACFG</name>
							<description>PCACFG</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth><access>read-write</access>
						</field><field>
							<name>FRBSREN</name>
							<description>FRBSREN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth><access>read-write</access>
						</field><field>
							<name>FRASREN</name>
							<description>FRASREN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth><access>read-write</access>
						</field><field>
							<name>RDNUMMCFG</name><description>RDNUMCFG</description>
							
							<bitOffset>6</bitOffset>
							<bitWidth>3</bitWidth><access>read-write</access>
						</field><field>
							<name>MODESET</name>
							<description>MODESET</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth><access>read-write</access>
						</field><field>
							<name>SRMFLG</name>
							<description>SRMFLG</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth><access>read-only</access>
						</field><field>
							<name>BANKNUMCFG</name>
							<description>BANKNUMCFG</description>
							<bitOffset>12</bitOffset>
							<bitWidth>5</bitWidth><access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REF</name>
					<displayName>REF</displayName>
					<description>refresh register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000C3</resetValue>
					<fields>
						<field>
							<name>RCYCCFG</name>
							<description>RCYCCFG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHIPSEL</name>
					<displayName>CHIPSEL</displayName>
					<description>Chip select register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BACHIPSEL</name>
							<description>BACHIPSEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MASK</name>
					<displayName>MASK</displayName>
					<description>Mask register</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000000D</resetValue>
					<fields>
						<field>
							<name>MSIZESEL</name>
							<description>MSIZESEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field><field>
							<name>MTYPESEL</name>
							<description>MTYPESEL</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SW</name>
					<displayName>SW</displayName>
					<description>switch register</description>
					<addressOffset>0x400</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MCSW</name>
							<description>Memory Controller Function Switch</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL2</name>
					<displayName>CTRL2</displayName>
					<description>Control register 2</description>
					<addressOffset>0x404</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000002E</resetValue>
					<fields>
						<field>
							<name>CPHACFG</name>
							<description>CPHACFG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RDDEN</name>
							<description>RDDEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RDDCFG</name>
							<description>RDDCFG</description>
							<bitOffset>2</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>WPEN</name>
							<description>WPEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>BUFFEN</name>
							<description>BUFFEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>WRPBSEL</name>
							<description>WRPBSEL</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral><peripheral>
            <name>OTG_FS_GLOBAL</name>
            <description>USB on the go full speed</description>
            <groupName>USB_OTG_FS</groupName>
            <baseAddress>0x50000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>OTG_FS_WKUP</name>
                <description>USB On-The-Go FS Wakeup through EINT line
        interrupt</description>
                <value>42</value>
            </interrupt>
            <interrupt>
                <name>OTG_FS</name>
                <description>USB On The Go FS global
        interrupt</description>
                <value>67</value>
            </interrupt>
            <registers>
                <register>
                    <name>GCTRLSTS</name>
                    <displayName>GCTRLSTS</displayName>
                    <description>OTG_FS control and status register
          (OTG_FS_GOTGCTL)</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000800</resetValue>
                    <fields>
                        <field>
                            <name>SREQSUC</name>
                            <description>Session request success</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SREQ</name>
                            <description>Session request</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HNSUC</name>
                            <description>Host negotiation success</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HNPREQ</name>
                            <description>HNP request</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HHNPEN</name>
                            <description>Host set HNP enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DHNPEN</name>
                            <description>Device HNP enabled</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CIDSTS</name>
                            <description>Connector ID status</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LSDEBT</name>
                            <description>Long/short debounce time</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ASVD</name>
                            <description>A-session valid</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BSVD</name>
                            <description>B-session valid</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GINT</name>
                    <displayName>GINT</displayName>
                    <description>OTG_FS interrupt register
          (OTG_FS_GOTGINT)</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SEFLG</name>
                            <description>Session end detected</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SREQSUCCHG</name>
                            <description>Session request success status
              change</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HNSUCCHG</name>
                            <description>Host negotiation success status
              change</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HNFLG</name>
                            <description>Host negotiation detected</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADTOFLG</name>
                            <description>A-device timeout change</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DEBDFLG</name>
                            <description>Debounce done</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAHBCFG</name>
                    <displayName>GAHBCFG</displayName>
                    <description>OTG_FS AHB configuration register
          (OTG_FS_GAHBCFG)</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GINTMASK</name>
                            <description>Global interrupt mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFEL</name>
                            <description>TxFIFO empty level</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PTXFEL</name>
                            <description>Periodic TxFIFO empty
              level</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GUSBCFG</name>
                    <displayName>GUSBCFG</displayName>
                    <description>OTG_FS USB configuration register
          (OTG_FS_GUSBCFG)</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000A00</resetValue>
                    <fields>
                        <field>
                            <name>SEFLG</name>
                            <description>FS timeout calibration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSSTSEL</name>
                            <description>Full Speed serial transceiver
              select</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SRPEN</name>
                            <description>SRP-capable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HNPEN</name>
                            <description>HNP-capable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRTIM</name>
                            <description>USB turnaround time</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FHMODE</name>
                            <description>Force host mode</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FDMODE</name>
                            <description>Force device mode</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTXP</name>
                            <description>Corrupt Tx packet</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GRSTCTRL</name>
                    <displayName>GRSTCTRL</displayName>
                    <description>OTG_FS reset register
          (OTG_FS_GRSTCTL)</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x20000000</resetValue>
                    <fields>
                        <field>
                            <name>CSRST</name>
                            <description>Core soft reset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSRST</name>
                            <description>HCLK soft reset</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HFCNTRST</name>
                            <description>Host frame counter reset</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXFFLU</name>
                            <description>RxFIFO flush</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFFLU</name>
                            <description>TxFIFO flush</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFNUM</name>
                            <description>TxFIFO number</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBMIDL</name>
                            <description>AHB master idle</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
